tutorials/compressible/rhopSonicFoam/wedge15Ma5/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

    rho
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    rhoU
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    rhoE
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    rhoH
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     2;
    HbyAblend       0.95;
}


// ************************************************************************* //
